#Напишите программу на Python для преобразования градусов в радианы.
def comp(n):
    return (n * 3.14)/180

a = float(input("Введите число: "))
print(comp(a))
